## Loading the Dataset

In [1]:
# Importing the necesssary Libraries

import warnings
warnings.filterwarnings("ignore")

import pandas as pd
import numpy as np

from IPython.display import display, HTML

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline 
%config InlineBackend.figure_format = 'retina'
plt.style.use("seaborn")

In [2]:
# Loading the data from the file Data_Cleansing using pandas library
Salary_filename = 'Salary Data.csv'
Salary = pd.read_csv(Salary_filename, sep=',', decimal='.', header=0)

In [3]:
#Checking the first five rows of the dataset
Salary.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [4]:
#Checking the last five rows of the dataset
Salary.tail()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [5]:
# Displaying all the columns and printing 10 rows of the dataframe
pd.set_option('display.max_columns', None) 
Salary.sample(10, random_state=999)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
324,29.0,Female,Bachelor's,Junior Marketing Analyst,2.0,40000.0
135,39.0,Female,Bachelor's,Administrative Assistant,10.0,55000.0
174,26.0,Female,Master's,Junior Data Scientist,1.5,45000.0
57,43.0,Male,PhD,Senior Engineer,17.0,140000.0
4,52.0,Male,Master's,Director,20.0,200000.0
243,46.0,Male,PhD,Senior Data Analyst,19.0,150000.0
226,46.0,Male,PhD,Senior Data Scientist,18.0,160000.0
354,31.0,Female,Bachelor's,Junior Business Development Associate,3.0,50000.0
312,44.0,Female,PhD,Senior Product Designer,15.0,150000.0
194,40.0,Female,Master's,Senior Human Resources Specialist,13.0,120000.0

In [6]:
# Checking the shape of the dataframe
Salary.shape

(375, 6)

In [7]:
# Checking the statistical summary of the dataframe
Salary.describe()

              Age  Years of Experience         Salary
count  373.000000           373.000000     373.000000
mean    37.431635            10.030831  100577.345845
std      7.069073             6.557007   48240.013482
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

In [8]:
# Checking the datatype of the attributes in the dataframe
Salary.dtypes

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

## Data Cleansing and Preprocessing

### 1) Renaming the columns with meaningful names

In [9]:
# Checking the column names of the dataframe
Salary.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [10]:
# Renaming the columns and removing the whitespaces
Salary.columns = Salary.columns.str.strip()

columns_mapping = {
    'Education Level' : 'Education_Level',
    'Job Title' : 'Job_Title',
    'Years of Experience' : 'Years_of_Experience',
}

Salary = Salary.rename(columns = columns_mapping)

Salary.head()

,Age,Gender,Education_Level,Job_Title,Years_of_Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

### 2) Checking for irregularities in the dataframe

In [11]:
# Checking for the unique values of the dataframe
Salary['Education_Level'].unique()

array(["Bachelor's", "Master's", 'PhD', nan], dtype=object)

In [12]:
Salary['Job_Title'].unique()

array(['Software Engineer', 'Data Analyst', 'Senior Manager',
       'Sales Associate', 'Director', 'Marketing Analyst',
       'Product Manager', 'Sales Manager', 'Marketing Coordinator',
       'Senior Scientist', 'Software Developer', 'HR Manager',
       'Financial Analyst', 'Project Manager', 'Customer Service Rep',
       'Operations Manager', 'Marketing Manager', 'Senior Engineer',
       'Data Entry Clerk', 'Sales Director', 'Business Analyst',
       'VP of Operations', 'IT Support', 'Recruiter', 'Financial Manager',
       'Social Media Specialist', 'Software Manager', 'Junior Developer',
       'Senior Consultant', 'Product Designer', 'CEO', 'Accountant',
       'Data Scientist', 'Marketing Specialist', 'Technical Writer',
       'HR Generalist', 'Project Engineer', 'Customer Success Rep',
       'Sales Executive', 'UX Designer', 'Operations Director',
       'Network Engineer', 'Administrative Assistant',
       'Strategy Consultant', 'Copywriter', 'Account Manager',
       'Director of Marketing', 'Help Desk Analyst',
       'Customer Service Manager', 'Business Intelligence Analyst',
       'Event Coordinator', 'VP of Finance', 'Graphic Designer',
       'UX Researcher', 'Social Media Manager', 'Director of Operations',
       'Senior Data Scientist', 'Junior Accountant',
       'Digital Marketing Manager', 'IT Manager',
       'Customer Service Representative', 'Business Development Manager',
       'Senior Financial Analyst', 'Web Developer', 'Research Director',
       'Technical Support Specialist', 'Creative Director',
       'Senior Software Engineer', 'Human Resources Director',
       'Content Marketing Manager', 'Technical Recruiter',
       'Sales Representative', 'Chief Technology Officer',
       'Junior Designer', 'Financial Advisor', 'Junior Account Manager',
       'Senior Project Manager', 'Principal Scientist',
       'Supply Chain Manager', 'Senior Marketing Manager',
       'Training Specialist', 'Research Scientist',
       'Junior Software Developer', 'Public Relations Manager',
       'Operations Analyst', 'Product Marketing Manager',
       'Senior HR Manager', 'Junior Web Developer',
       'Senior Project Coordinator', 'Chief Data Officer',
       'Digital Content Producer', 'IT Support Specialist',
       'Senior Marketing Analyst', 'Customer Success Manager',
       'Senior Graphic Designer', 'Software Project Manager',
       'Supply Chain Analyst', 'Senior Business Analyst',
       'Junior Marketing Analyst', 'Office Manager', 'Principal Engineer',
       'Junior HR Generalist', 'Senior Product Manager',
       'Junior Operations Analyst', 'Senior HR Generalist',
       'Sales Operations Manager', 'Senior Software Developer',
       'Junior Web Designer', 'Senior Training Specialist',
       'Senior Research Scientist', 'Junior Sales Representative',
       'Junior Marketing Manager', 'Junior Data Analyst',
       'Senior Product Marketing Manager', 'Junior Business Analyst',
       'Senior Sales Manager', 'Junior Marketing Specialist',
       'Junior Project Manager', 'Senior Accountant', 'Director of Sales',
       'Junior Recruiter', 'Senior Business Development Manager',
       'Senior Product Designer', 'Junior Customer Support Specialist',
       'Senior IT Support Specialist', 'Junior Financial Analyst',
       'Senior Operations Manager', 'Director of Human Resources',
       'Junior Software Engineer', 'Senior Sales Representative',
       'Director of Product Management', 'Junior Copywriter',
       'Senior Marketing Coordinator', 'Senior Human Resources Manager',
       'Junior Business Development Associate', 'Senior Account Manager',
       'Senior Researcher', 'Junior HR Coordinator',
       'Director of Finance', 'Junior Marketing Coordinator', nan,
       'Junior Data Scientist', 'Senior Operations Analyst',
       'Senior Human Resources Coordinator', 'Senior UX Designer',
       'Junior Product Manager', 'Senior Marketing Specialist',
       'Senior IT Project Manager', 'Senior Quality Assurance Analyst',
       'Director of Sales and Marketing', 'Senior Account Executive',
       'Director of Business Development', 'Junior Social Media Manager',
       'Senior Human Resources Specialist', 'Senior Data Analyst',
       'Director of Human Capital', 'Junior Advertising Coordinator',
       'Junior UX Designer', 'Senior Marketing Director',
       'Senior IT Consultant', 'Senior Financial Advisor',
       'Junior Business Operations Analyst',
       'Junior Social Media Specialist',
       'Senior Product Development Manager', 'Junior Operations Manager',
       'Senior Software Architect', 'Junior Research Scientist',
       'Senior Financial Manager', 'Senior HR Specialist',
       'Senior Data Engineer', 'Junior Operations Coordinator',
       'Director of HR', 'Senior Operations Coordinator',
       'Junior Financial Advisor', 'Director of Engineering'],
      dtype=object)

In [ ]:
Salary['Education_Level'].unique()

### 3) Checking for missing values in the dataframe

In [13]:
# Checking for missing values in the dataframe
Salary.isnull().sum()

Age                    2
Gender                 2
Education_Level        2
Job_Title              2
Years_of_Experience    2
Salary                 2
dtype: int64

In [20]:
# Dropping the rows that contains missing values
Salary2 = Salary.dropna()

In [21]:
# Checking for missing values in the dataframe
Salary2.isnull().sum()

Age                    0
Gender                 0
Education_Level        0
Job_Title              0
Years_of_Experience    0
Salary                 0
dtype: int64

### 4) Summary Statistics of the numerical and categoical features

In [23]:
# Checking the Summary Statistics of the Categorical features
display(HTML('<b>Summary Statistics of categorical features</b>'))
Salary2.describe(include='object').T

                count unique                    top freq
Gender            373      2                   Male  194
Education_Level   373      3             Bachelor's  224
Job_Title         373    174  Director of Marketing   12

In [24]:
# Checking the Summary Statistics of the Numerical features
display(HTML('<b>Summary Statistics of numerical features</b>'))
Salary2.describe(include=['int64','float64']).T

,count,mean,std,min,25%,50%,75%,max
Age,373.0,37.431635,7.069073,23.0,31.0,36.0,44.0,53.0
Years_of_Experience,373.0,10.030831,6.557007,0.0,4.0,9.0,15.0,25.0
Salary,373.0,100577.345845,48240.013482,350.0,55000.0,95000.0,140000.0,250000.0

### 5) Converting the categorical features into numerical features

In [27]:
# Converting the gender column into numerical feature using replace() function
Salary2['Gender'].replace('Male', 1, inplace = True)
Salary2['Gender'].replace('Female', 0, inplace = True)
Salary2.head()

,Age,Gender,Education_Level,Job_Title,Years_of_Experience,Salary
0,32.0,1,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,0,Master's,Data Analyst,3.0,65000.0
2,45.0,1,PhD,Senior Manager,15.0,150000.0
3,36.0,0,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,1,Master's,Director,20.0,200000.0

In [28]:
# one-hot encoding of the categorical descriptive features
Salary2_onehot = pd.get_dummies(Salary2, columns=['Education_Level'])
Salary2_onehot.head()

,Age,Gender,Job_Title,Years_of_Experience,Salary,Education_Level_Bachelor's,Education_Level_Master's,Education_Level_PhD
0,32.0,1,Software Engineer,5.0,90000.0,1,0,0
1,28.0,0,Data Analyst,3.0,65000.0,0,1,0
2,45.0,1,Senior Manager,15.0,150000.0,0,0,1
3,36.0,0,Sales Associate,7.0,60000.0,1,0,0
4,52.0,1,Director,20.0,200000.0,0,1,0

In [29]:
# To obtain the column names.
Salary2_onehot.columns

Index(['Age', 'Gender', 'Job_Title', 'Years_of_Experience', 'Salary',
       'Education_Level_Bachelor's', 'Education_Level_Master's',
       'Education_Level_PhD'],
      dtype='object')